In [2]:
import requests
import csv
from datetime import datetime
import zipfile
import io
import pandas as pd
pd.options.display.max_columns = 150
pd.options.display.max_rows = 150

# recupere le document csv

In [3]:
url ='https://www.ecb.europa.eu/stats/eurofxref/eurofxref-hist.zip?bd049ef55462a7bf91e6643cd0735a01'

response = requests.get(url)

if response.status_code == 200:
    # Extraction du contenu du fichier zip dans un objet de type ZipFile
    with zipfile.ZipFile(io.BytesIO(response.content), 'r') as zip_ref:
        # Choisissez l'emplacement où vous souhaitez extraire les fichiers
        extraction_path = 'dossier_taux_bce'
        zip_ref.extractall(extraction_path)
    print("Extraction réussie.")
else:
    print("Échec de la requête de téléchargement.")

Extraction réussie.

# nettoyage de data 
## suite l'analise des donnes manquantes a cause de circonstantce actuelle ou historique nous avons des valeurs  manquantes, je decide de garder sans supprimer colonnes.

In [4]:
import pandas as pd

# Importer le CSV
csv_path = "dossier_taux_bce/eurofxref-hist.csv"
df = pd.read_csv(csv_path)
df.rename(columns={'Date': 'date'}, inplace=True)
df['date'] = pd.to_datetime(df['date'])

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6304 entries, 0 to 6303
Data columns (total 43 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         6304 non-null   datetime64[ns]
 1   USD          6304 non-null   float64
 2   JPY          6304 non-null   float64
 3   BGN          5906 non-null   float64
 4   CYP          2304 non-null   float64
 5   CZK          6304 non-null   float64
 6   DKK          6304 non-null   float64
 7   EEK          3074 non-null   float64
 8   GBP          6304 non-null   float64
 9   HUF          6304 non-null   float64
 10  LTL          4097 non-null   float64
 11  LVL          3842 non-null   float64
 12  MTL          2304 non-null   float64
 13  PLN          6304 non-null   float64
 14  ROL          1664 non-null   float64
 15  RON          4640 non-null   float64
 16  SEK          6304 non-null   float64
 17  SIT          2049 non-null   float64
 18  SKK          2560 non-null   float64
 19  CHF          6304 non-null   float64
 20  ISK          3963 non-null   float64
 21  NOK          6304 non-null   float64
 22  HRK          4548 non-null   float64
 23  RUB          4333 non-null   float64
 24  TRL          1537 non-null   float64
 25  TRY          4767 non-null   float64
 26  AUD          6304 non-null   float64
 27  BRL          4000 non-null   float64
 28  CAD          6304 non-null   float64
 29  CNY          4705 non-null   float64
 30  HKD          6304 non-null   float64
 31  IDR          4705 non-null   float64
 32  ILS          3230 non-null   float64
 33  INR          3744 non-null   float64
 34  KRW          6304 non-null   float64
 35  MXN          4000 non-null   float64
 36  MYR          4705 non-null   float64
 37  NZD          6304 non-null   float64
 38  PHP          4705 non-null   float64
 39  SGD          6304 non-null   float64
 40  THB          4705 non-null   float64
 41  ZAR          6304 non-null   float64
 42  Unnamed: 42  0 non-null      float64
dtypes: datetime64[ns](1), float64(42)
memory usage: 2.1 MB

In [32]:
liste_des_current

,date,USD,JPY,BGN,CYP,CZK,DKK,EEK,GBP,HUF,LTL,LVL,MTL,PLN,ROL,RON,SEK,SIT,SKK,CHF,ISK,NOK,HRK,RUB,TRL,TRY,AUD,BRL,CAD,CNY,HKD,IDR,ILS,INR,KRW,MXN,MYR,NZD,PHP,SGD,THB,ZAR,Unnamed: 42
0,2023-08-10,1.1019,158.43,1.9558,NaN,24.223,7.4512,NaN,0.86313,385.13,NaN,NaN,NaN,4.4548,NaN,4.9432,11.6940,NaN,NaN,0.9618,144.50,11.1785,NaN,NaN,NaN,29.7942,1.6767,5.3872,1.4764,7.9434,8.6127,16720.23,4.0975,91.0983,1446.32,18.7458,5.0368,1.8123,61.820,1.4826,38.583,20.6870,NaN
1,2023-08-09,1.0968,157.35,1.9558,NaN,24.293,7.4511,NaN,0.86180,388.44,NaN,NaN,NaN,4.4670,NaN,4.9480,11.7195,NaN,NaN,0.9627,144.50,11.2063,NaN,NaN,NaN,29.6458,1.6779,5.3664,1.4740,7.9030,8.5766,16661.91,4.0753,90.8795,1441.47,18.8106,5.0146,1.8103,61.728,1.4761,38.361,20.8921,NaN
2,2023-08-08,1.0944,156.55,1.9558,NaN,24.240,7.4515,NaN,0.86158,388.50,NaN,NaN,NaN,4.4500,NaN,4.9498,11.7440,NaN,NaN,0.9600,144.90,11.2950,NaN,NaN,NaN,29.5716,1.6827,5.3970,1.4755,7.8950,8.5491,16665.11,4.0550,90.6614,1444.82,18.8176,5.0151,1.8116,61.747,1.4766,38.348,20.6870,NaN
3,2023-08-07,1.0984,156.21,1.9558,NaN,24.224,7.4515,NaN,0.86163,389.50,NaN,NaN,NaN,4.4138,NaN,4.9490,11.6625,NaN,NaN,0.9625,145.10,11.1485,NaN,NaN,NaN,29.6575,1.6715,5.3609,1.4688,7.8976,8.5744,16688.03,4.0335,90.8738,1436.38,18.7490,5.0076,1.8004,61.654,1.4730,38.246,20.4371,NaN
4,2023-08-04,1.0946,156.11,1.9558,NaN,24.260,7.4514,NaN,0.86193,391.73,NaN,NaN,NaN,4.4485,NaN,4.9530,11.7000,NaN,NaN,0.9598,144.90,11.1858,NaN,NaN,NaN,29.5436,1.6694,5.3729,1.4648,7.8661,8.5485,16624.59,4.0347,90.7300,1435.40,18.9566,4.9859,1.8009,61.073,1.4701,38.081,20.4214,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6298,1999-01-08,1.1659,130.09,NaN,0.58187,34.938,7.4433,15.6466,0.70940,250.15,4.6643,0.6654,0.4419,4.0363,13143.0,NaN,9.1650,188.840,42.560,1.6138,80.99,8.5900,NaN,NaN,371830.0,NaN,1.8406,NaN,1.7643,NaN,9.0302,NaN,NaN,NaN,1366.73,NaN,NaN,2.1557,NaN,1.9537,NaN,6.7855,NaN
6299,1999-01-07,1.1632,129.43,NaN,0.58187,34.886,7.4431,15.6466,0.70585,250.09,4.6548,0.6627,0.4413,4.0165,13092.0,NaN,9.1800,188.800,42.765,1.6165,81.06,8.6295,NaN,NaN,370147.0,NaN,1.8474,NaN,1.7602,NaN,9.0131,NaN,NaN,NaN,1337.16,NaN,NaN,2.1531,NaN,1.9436,NaN,6.8283,NaN
6300,1999-01-06,1.1743,131.42,NaN,0.58200,34.850,7.4452,15.6466,0.70760,250.67,4.6994,0.6649,0.4420,4.0065,13168.0,NaN,9.3050,188.700,42.778,1.6116,81.54,8.7335,NaN,NaN,372188.0,NaN,1.8820,NaN,1.7711,NaN,9.1010,NaN,NaN,NaN,1359.54,NaN,NaN,2.1890,NaN,1.9699,NaN,6.7307,NaN
6301,1999-01-05,1.1790,130.96,NaN,0.58230,34.917,7.4495,15.6466,0.71220,250.80,4.7174,0.6657,0.4432,4.0245,13168.0,NaN,9.4025,188.775,42.848,1.6123,81.53,8.7745,NaN,NaN,372816.0,NaN,1.8944,NaN,1.7965,NaN,9.1341,NaN,NaN,NaN,1373.01,NaN,NaN,2.2011,NaN,1.9655,NaN,6.7975,NaN
6302,1999-01-04,1.1789,133.73,NaN,0.58231,35.107,7.4501,15.6466,0.71110,251.48,4.7170,0.6668,0.4432,4.0712,13111.0,NaN,9.4696,189.045,42.991,1.6168,81.48,8.8550,NaN,NaN,372274.0,NaN,1.9100,NaN,1.8004,NaN,9.1332,NaN,NaN,NaN,1398.59,NaN,NaN,2.2229,NaN,1.9554,NaN,6.9358,NaN

## depuis le 1er janvier 2008, l’euro CYP(EUR) 0,585274 CYP
## l’euro (EUR) a remplacé la couronne estonienne (EEK) au taux de conversion fixe de 1 EUR = 15,6466 EEK Estonie ( depuis le 1er janvier 2011 )
## l’euro (EUR) a remplacé le litas (LTL) au taux de change fixe de 1 EUR = LTL 3.45280  Lituanie ( depuis le 1er janvier 2015 )
## l’euro (EUR) a remplacé le lats (LVL) au taux de change fixe de 1 EUR = LVL 0.702804  Lettonie ( depuis le 1er janvier 2014 )
## l’euro (EUR) a remplaçant la lire maltaise (MTL) au taux de conversion fixé irrévocablement à 1 EUR = MTL 0.429300 Malte ( depuis le 1er janvier 2008 )
## ROL_old_RON_before_2005
## l’euro (EUR) a remplaçant la tolar slovène (SIT) au taux de conversion fixé irrévocablement à 1 EUR = 239.640 SIT Slovénie (2007) 

## l’euro (EUR) a remplaçant la couronne slovaque (SKK) au taux de conversion fixé irrévocablement à 1 EUR = 30,1260 SKK Slovaquie ( depuis le 1er janvier 2009 )
## l’euro (EUR) a remplaçant la couronne slovaque (SKK) au taux de conversion fixé irrévocablement à 1 EUR = 7.53450 HRK  Croatia (since 1 January 2023)
## La BCE a donc décidé de suspendre jusqu'à nouvel ordre la publication d'un taux de référence de l'euro pour le rouble russe. La BCE a publié pour la dernière fois un taux de référence EUR/RUB le 1er mars 2022.
## TRL_old_TRY_before_2009

## a faire plus tard ajouter  UAH de urkraine  des modification selon la politique de bce

In [33]:
start_date = pd.to_datetime('2008-01-01')
df.loc[df['date'] >= start_date, 'CYP'] = df.loc[df['date'] >= start_date, 'CYP'].fillna(0.585274)
df.rename(columns={'CYP': 'CYP_EURO_2008'}, inplace=True)

In [36]:
start_date = pd.to_datetime('2011-01-01')
df.loc[df['date'] >= start_date, 'EEK'] = df.loc[df['date'] >= start_date, 'EEK'].fillna(15.6466)
df.rename(columns={'EEK': 'EEK_EURO_2011'}, inplace=True)

In [38]:
start_date = pd.to_datetime('2015-01-01')
df.loc[df['date'] >= start_date, 'LTL'] = df.loc[df['date'] >= start_date, 'LTL'].fillna(3.45280)
df.rename(columns={'LTL': 'LTL_EURO_2015'}, inplace=True)

In [40]:
#l’euro (EUR) a remplacé le lats (LVL) au taux de change fixe de 1 EUR = LVL 0.702804  Lettonie ( depuis le 1er janvier 2014 )
start_date = pd.to_datetime('2014-01-01')
df.loc[df['date'] >= start_date, 'LVL'] = df.loc[df['date'] >= start_date, 'LVL'].fillna(0.702804)
df.rename(columns={'LVL': 'LVL_EURO_2014'}, inplace=True)

In [42]:
# l’euro (EUR) a remplaçant la lire maltaise (MTL) au taux de conversion fixé irrévocablement à 1 EUR = MTL 0.429300 Malte ( depuis le 1er janvier 2008 )
start_date = pd.to_datetime('2008-01-01')
df.loc[df['date'] >= start_date, 'MTL'] = df.loc[df['date'] >= start_date, 'MTL'].fillna(0.429300)
df.rename(columns={'MTL': 'MTL_EURO_2018'}, inplace=True)

In [44]:
# ROL_oldRON_before_2005

df.rename(columns={'ROL': 'ROL_oldRON_before_2005'}, inplace=True)

In [46]:
#l’euro (EUR) a remplaçant la tolar slovène (SIT) au taux de conversion fixé irrévocablement à 1 EUR = 239.640 SIT Slovénie (2007) 
start_date = pd.to_datetime('2007-01-01')
df.loc[df['date'] >= start_date, 'SIT'] = df.loc[df['date'] >= start_date, 'SIT'].fillna(239.640)
df.rename(columns={'SIT': 'SIT_EURO_2007'}, inplace=True)

In [48]:
# l’euro (EUR) a remplaçant la couronne slovaque (SKK) au taux de conversion fixé irrévocablement à 1 EUR = 30.1260 SKK Slovaquie ( depuis le 1er janvier 2009 )
start_date = pd.to_datetime('2009-01-01')
df.loc[df['date'] >= start_date, 'SKK'] = df.loc[df['date'] >= start_date, 'SKK'].fillna(30.1260)
df.rename(columns={'SKK': 'SKK_EURO_2009'}, inplace=True)

In [50]:
# l’euro (EUR) a remplaçant la couronne slovaque (SKK) au taux de conversion fixé irrévocablement à 1 EUR = 7.53450 HRK  Croatia (since 1 January 2023)
start_date = pd.to_datetime('2023-01-01')
df.loc[df['date'] >= start_date, 'HRK'] = df.loc[df['date'] >= start_date, 'HRK'].fillna(7.53450)
df.rename(columns={'HRK': 'HRK_EURO_2023'}, inplace=True)

In [52]:
# TRL_old_TRY_before_2009
df.rename(columns={'TRL': 'TRL_old_TRY_before_2009'}, inplace=True)

In [61]:
df.columns

Index(['date', 'USD', 'JPY', 'BGN', 'CYP_EURO_2008', 'CZK', 'DKK',
       'EEK_EURO_2011', 'GBP', 'HUF', 'LTL_EURO_2015', 'LVL_EURO_2014',
       'MTL_EURO_2018', 'PLN', 'ROL_oldRON_before_2005', 'RON', 'SEK',
       'SIT_EURO_2007', 'SKK_EURO_2009', 'CHF', 'ISK', 'NOK', 'HRK_EURO_2023',
       'RUB', 'TRL_old_TRY_before_2009', 'TRY', 'AUD', 'BRL', 'CAD', 'CNY',
       'HKD', 'IDR', 'ILS', 'INR', 'KRW', 'MXN', 'MYR', 'NZD', 'PHP', 'SGD',
       'THB', 'ZAR', 'Unnamed: 42'],
      dtype='object')

In [69]:
melted_df = df.melt(id_vars=['date'], var_name='key_change', value_name='taux')

In [71]:
melted_df

             date key_change    taux
0      2023-08-10        USD  1.1019
1      2023-08-09        USD  1.0968
2      2023-08-08        USD  1.0944
3      2023-08-07        USD  1.0984
4      2023-08-04        USD  1.0946
...           ...        ...     ...
258418 1999-01-08        ZAR  6.7855
258419 1999-01-07        ZAR  6.8283
258420 1999-01-06        ZAR  6.7307
258421 1999-01-05        ZAR  6.7975
258422 1999-01-04        ZAR  6.9358

[258423 rows x 3 columns]

In [76]:
final_df = melted_df[['date', 'taux', 'key_change']].sort_values([ 'date','key_change'],ascending=False)
final_df

             date     taux               key_change
252120 2023-08-10  20.6870                      ZAR
0      2023-08-10   1.1019                      USD
151272 2023-08-10  29.7942                      TRY
144969 2023-08-10      NaN  TRL_old_TRY_before_2009
245817 2023-08-10  38.5830                      THB
...           ...      ...                      ...
119756 1999-01-04   1.6168                      CHF
176483 1999-01-04   1.8004                      CAD
170180 1999-01-04      NaN                      BRL
18908  1999-01-04      NaN                      BGN
163877 1999-01-04   1.9100                      AUD

[258423 rows x 3 columns]

In [77]:
final_df

             date     taux               key_change
252120 2023-08-10  20.6870                      ZAR
0      2023-08-10   1.1019                      USD
151272 2023-08-10  29.7942                      TRY
144969 2023-08-10      NaN  TRL_old_TRY_before_2009
245817 2023-08-10  38.5830                      THB
...           ...      ...                      ...
119756 1999-01-04   1.6168                      CHF
176483 1999-01-04   1.8004                      CAD
170180 1999-01-04      NaN                      BRL
18908  1999-01-04      NaN                      BGN
163877 1999-01-04   1.9100                      AUD

[258423 rows x 3 columns]

In [63]:
if "Unnamed: 42" in df.columns:
    df.drop(columns=["Unnamed: 42"], inplace=True)

In [62]:
liste_valeurs = df.columns
if "Unnamed: 42" in liste_valeurs:
    print("UAH est dans la liste.")
else:
    print("UAH n'est pas dans la liste.")

UAH est dans la liste.

# creer une fonction de resquests

# transformer le csv en format wpd